<picture><img height="50" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/header.svg" /></picture> 




<div align="right">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<picture><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/high.svg" /></picture>&nbsp;1&nbsp;High&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<picture><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/low.svg" /></picture>&nbsp;4&nbsp;Low</div><br>

<table>

<thead>

<tr>

<th align="left" scope="col">Risk ID</th>

<th align="left" scope="col">Severity</th>

<th align="left" scope="col">Vendor</th>

<th align="left" scope="col">Folder/s</th>

<th align="left" scope="col">Summary</th>

</tr>

</thead>

<tbody id="tableBody">

<tr>

<td>I07-I-SG</td>

<td align="center"><picture><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/high.svg" /></picture></td>

<td align="center"><sub><picture><img width="24" height="24" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/aws.svg" /></picture></sub></td>

<td>Scenario 2</td>

<td>LDAP Port TCP/389, UDP/389 open from Public IPs</td>

</tr>
<tr>

<td>O06-NI-SG</td>

<td align="center"><picture><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/low.svg" /></picture></td>

<td align="center"><sub><picture><img width="24" height="24" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/aws.svg" /></picture></sub></td>

<td>Scenario 12</td>

<td>SMTP can exit your network to more than 256 Private IPs</td>

</tr>
<tr>

<td>Auto07</td>

<td align="center"><picture><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/low.svg" /></picture></td>

<td align="center"><sub><picture><img width="24" height="24" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/aws.svg" /></picture></sub></td>

<td>Scenario 2</td>

<td>CIDR test</td>

</tr>
<tr>

<td>Auto08</td>

<td align="center"><picture><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/low.svg" /></picture></td>

<td align="center"><sub><picture><img width="24" height="24" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/aws.svg" /></picture></sub></td>

<td>Scenario 2</td>

<td>public ips</td>

</tr>
<tr>

<td>Auto09</td>

<td align="center"><picture><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/low.svg" /></picture></td>

<td align="center"><sub><picture><img width="24" height="24" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/aws.svg" /></picture></sub></td>

<td>Scenario 2</td>

<td>multiple public ips</td>

</tr>
                 
</tbody>
</table>

**Detailed Risks Report**
---
<details>
<summary><sub><sub><sub><picture><img height="20" width="20" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/warning.svg" /></picture></sub></sub></sub>&nbsp;&nbsp;<h3><b>Scenario 12</b></h3><div  align="right">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<picture><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/low.svg" /></picture>&nbsp;1&nbsp;Low</div></summary>
<details>

<summary><picture><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/low.svg" /></picture>  O06-NI-SG</summary> 

### **Title:**
SMTP can exit your network to more than 256 Private IPs

### **Description:**
 Allowing outbound SMTP access on TCP port  25/465/587 from many internal machines is risky.  Outbound SMTP (E-mail) should only originate from your public mail servers.  E-mail is a vector for many viruses and worms.  Computers that can send E-mail directly (not through your organization's designated mail servers) can bypass your network's E-mail filters, and spread viruses and worms to other networks.  Therefore, outbound SMTP access should be limited to your properly hardened public mail servers. 
    


### **Recommendation:**
Restrict the rules to refer to only the destination IPs you really use, and limit the number of public IP addresses that can be reached on this port. 

### **Details:**
<table>
<thead>

<tr>

<th align="left" scope="col">Vendor</th>

<th align="left" scope="col">From Port</th>

<th align="left" scope="col">To Port</th>

<th align="left" scope="col">Ip Protocol</th>

<th align="left" scope="col">Ip Range</th>

</tr>

</thead>

<tbody id="tableBody">

<tr>

  <td>AWS</td>

  <td>25</td>

  <td>25</td>

  <td>tcp</td>

  <td>172.16.0.0/16</td>

  </tr>
                
</tbody>
</table>

</details>



<details>
<summary>Terraform Log</summary>
<br>Output

```


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_security_group.Scenario12 will be created
  + resource "aws_security_group" "Scenario12" {
      + arn                    = (known after apply)
      + description            = "egress"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "172.16.0.0/16",
                ]
              + description      = ""
              + from_port        = 25
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 25
            },
          + {
              + cidr_blocks      = [
                  + "172.16.0.0/16",
                ]
              + description      = ""
              + from_port        = 25
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "udp"
              + security_groups  = []
              + self             = false
              + to_port          = 25
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "Scenario12"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "SG with Single port(UDP and TCP) and single IP "
        }
      + tags_all               = {
          + "Name" = "SG with Single port(UDP and TCP) and single IP "
        }
      + vpc_id                 = "vpc-481b202f"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /home/runner/work/DevSecpsRepoForAutomation/DevSecpsRepoForAutomation_ALGOSEC_CODE_ANALYSIS/Scenario 12\tmp\Scenario 12.out

To perform exactly these actions, run the following command to apply:
    terraform apply "/home/runner/work/DevSecpsRepoForAutomation/DevSecpsRepoForAutomation_ALGOSEC_CODE_ANALYSIS/Scenario 12\\tmp\\Scenario 12.out"


```
<br>

</details> <!-- End Format Logs -->

</details>

---

<details>
<summary><sub><sub><sub><picture><img height="20" width="20" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/warning.svg" /></picture></sub></sub></sub>&nbsp;&nbsp;<h3><b>Scenario 2</b></h3><div  align="right">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<picture><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/high.svg" /></picture>&nbsp;1&nbsp;High&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<picture><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/low.svg" /></picture>&nbsp;3&nbsp;Low</div></summary>
<details>

<summary><picture><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/high.svg" /></picture>  I07-I-SG</summary> 

### **Title:**
LDAP Port TCP/389, UDP/389 open from Public IPs

### **Description:**
Your cloud  LDAP server is accessible using the LDAP port (UDP/389, TCP/389).  LDAP (Lightweight Directory Access Protocol) is a directory service for controling access to network capable devices. Allowing access to these ports from public IP addresses is risky.


### **Recommendation:**
Eliminate rules which allow access to this port from the Internet.


### **Details:**
<table>
<thead>

<tr>

<th align="left" scope="col">Vendor</th>

<th align="left" scope="col">From Port</th>

<th align="left" scope="col">To Port</th>

<th align="left" scope="col">Ip Protocol</th>

<th align="left" scope="col">Ip Range</th>

</tr>

</thead>

<tbody id="tableBody">

<tr>

  <td>AWS</td>

  <td>389</td>

  <td>389</td>

  <td>tcp</td>

  <td>0.0.0.0/0</td>

  </tr>
<tr>

  <td>AWS</td>

  <td>389</td>

  <td>389</td>

  <td>udp</td>

  <td>0.0.0.0/0</td>

  </tr>
                
</tbody>
</table>

</details>
<details>

<summary><picture><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/low.svg" /></picture>  Auto07</summary> 

### **Title:**
CIDR test

### **Description:**
Automation Desc

### **Recommendation:**
Auto recommendation

### **Details:**
<table>
<thead>

<tr>

<th align="left" scope="col">Vendor</th>

<th align="left" scope="col">From Port</th>

<th align="left" scope="col">To Port</th>

<th align="left" scope="col">Ip Protocol</th>

<th align="left" scope="col">Ip Range</th>

</tr>

</thead>

<tbody id="tableBody">

<tr>

  <td>AWS</td>

  <td>389</td>

  <td>389</td>

  <td>tcp</td>

  <td>0.0.0.0/0</td>

  </tr>
<tr>

  <td>AWS</td>

  <td>389</td>

  <td>389</td>

  <td>udp</td>

  <td>0.0.0.0/0</td>

  </tr>
                
</tbody>
</table>

</details>
<details>

<summary><picture><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/low.svg" /></picture>  Auto08</summary> 

### **Title:**
public ips

### **Description:**
Automation Desc

### **Recommendation:**
Auto recommendation

### **Details:**
<table>
<thead>

<tr>

<th align="left" scope="col">Vendor</th>

<th align="left" scope="col">From Port</th>

<th align="left" scope="col">To Port</th>

<th align="left" scope="col">Ip Protocol</th>

<th align="left" scope="col">Ip Range</th>

</tr>

</thead>

<tbody id="tableBody">

<tr>

  <td>AWS</td>

  <td>389</td>

  <td>389</td>

  <td>udp</td>

  <td>0.0.0.0/0</td>

  </tr>
                
</tbody>
</table>

</details>
<details>

<summary><picture><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/low.svg" /></picture>  Auto09</summary> 

### **Title:**
multiple public ips

### **Description:**
Automation Desc

### **Recommendation:**
Auto recommendation

### **Details:**
<table>
<thead>

<tr>

<th align="left" scope="col">Vendor</th>

<th align="left" scope="col">From Port</th>

<th align="left" scope="col">To Port</th>

<th align="left" scope="col">Ip Protocol</th>

<th align="left" scope="col">Ip Range</th>

</tr>

</thead>

<tbody id="tableBody">

<tr>

  <td>AWS</td>

  <td>389</td>

  <td>389</td>

  <td>udp</td>

  <td>0.0.0.0/0</td>

  </tr>
                
</tbody>
</table>

</details>



<details>
<summary>Terraform Log</summary>
<br>Output

```

aws_security_group.Scenario2: Refreshing state... [id=sg-01f3f801bfc0ed9bc]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_security_group.Scenario2 will be created
  + resource "aws_security_group" "Scenario2" {
      + arn                    = (known after apply)
      + description            = "Ingress"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 389
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 389
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 389
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "udp"
              + security_groups  = []
              + self             = false
              + to_port          = 389
            },
        ]
      + name                   = "SG with Single port(UDP and TCP) and all IP. "
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "Scenario2"
        }
      + tags_all               = {
          + "Name" = "Scenario2"
        }
      + vpc_id                 = "vpc-481b202f"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /home/runner/work/DevSecpsRepoForAutomation/DevSecpsRepoForAutomation_ALGOSEC_CODE_ANALYSIS/Scenario 2\tmp\Scenario 2.out

To perform exactly these actions, run the following command to apply:
    terraform apply "/home/runner/work/DevSecpsRepoForAutomation/DevSecpsRepoForAutomation_ALGOSEC_CODE_ANALYSIS/Scenario 2\\tmp\\Scenario 2.out"


```
<br>

</details> <!-- End Format Logs -->

</details>

---


<br>
Pusher: @similAlgo<br>
Action: pull_request<br>
Workflow: Test Repo CI/CD